# AlphanumericRevisionSettings Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AlphanumericRevisionSettings Constructor
AlphanumericRevisionSettings Class See Also
---
Constructs an AlphanumericRevisionSettings with a simple, default sequence.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public AlphanumericRevisionSettings()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
AlphanumericRevisionSettings()
```

# Remarks
The default sequence contains each letter of the alphabet (may differ based on language settings).
# See Also
AlphanumericRevisionSettings Class
AlphanumericRevisionSettings Overload
Autodesk.Revit.DB Namespace